Revit 2026 API

# IExternalServerGetVendorId Method

---

Implement this method to return the id of the vendor of the server.

**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
string GetVendorId()
```
```vb
Function GetVendorId As String
```
```cpp
String^ GetVendorId()
```
```fsharp
abstract GetVendorId : unit -> string
```

#### Return Value

String Vendor Id of the server.

The Id is expected to be a string consisting of 4 characters.

#### Reference

IExternalServer Interface

Autodesk.Revit.DB.ExternalService Namespace